package org.example.grokkaiAlgorithms.chapter_second.grokkai2_1;

public class grokkai2_1 {
    /**
     * Задача :
     * допустим вы строите приложение для управления финансами ежедневно
     * Вы записываете свои траты в конце месяца вы анализируете расходы вычисляйте
     * Сколько денег было потрачено при работе с данными выполняется множество операций вставки относительно
     * немного операций чтения Какую структуру использовать мотив или список
     *
     * Решение:
     * ArrayList: ArrayList - это список, который может хранить объекты.
     * Вам можно использовать ArrayList для хранения объектов траты, каждый из которых будет содержать информацию о дате, сумме и категории траты.
     * HashMap: HashMap - это словарь, который может хранить пары ключ-значение.
     * Вам можно использовать HashMap для хранения данных о тратах, где ключом будет дата, а значением - сумма траты.
     * TreeMap: TreeMap - это словарь, который может хранить пары ключ-значение, отсортированные по ключу.
     * Вам можно использовать TreeMap для хранения данных о тратах, где ключом будет дата, а значением - сумма траты, и отсортировать данные по дате.
     *
     * Я бы рекомендовал использовать ArrayList или HashMap, потому что вам нужно хранить данные о трахах в течение месяца, а затем анализировать их.
     *
     * ArrayList может быть подходящим выбором, если вам нужно часто добавлять и удалять элементы из списка трат.
     * ArrayList также может быть полезен, если вам нужно хранить дополнительную информацию о трахах, например, категорию траты или комментарий.
     *
     * HashMap может быть подходящим выбором, если вам нужно быстро найти и анализировать данные о трахах по дате.
     * HashMap также может быть полезен, если вам нужно хранить только сумму траты для каждой даты, а не дополнительную информацию.
     *
     * TreeMap может быть подходящим выбором, если вам нужно отсортировать данные о трахах по дате и анализировать их.
     * TreeMap также может быть полезен, если вам нужно хранить только сумму траты для каждой даты, а не дополнительную информацию.
     */
}
